{
    "version": "https://jsonfeed.org/version/1",
    "title": "Zara RW Storm",
    "description": "",
    "home_page_url": "https://deathpigeon.github.io/zara-rw-storm",
    "feed_url": "https://deathpigeon.github.io/zara-rw-storm/feed.json",
    "user_comment": "",
    "author": {
        "name": "Zara RW Storm"
    },
    "items": [
        {
            "id": "https://deathpigeon.github.io/zara-rw-storm/farewell-ghost-crimes/",
            "url": "https://deathpigeon.github.io/zara-rw-storm/farewell-ghost-crimes/",
            "title": "Farewell (Ghost Crimes)",
            "summary": "Star knelt at the freshly dug earth. Death filled the space. Not as a physical feeling. There wasn’t some cold or smell or vibration that told them that someone dead was here. Instead, there was a gnawing sense of the inevitability of the end clawing&hellip;",
            "content_html": "<p>Star knelt at the freshly dug earth. Death filled the space. Not as a physical feeling. There wasn’t some cold or smell or vibration that told them that someone dead was here. Instead, there was a gnawing sense of the inevitability of the end clawing at the back of their head.</p>\n<p>They look up at their client, Lyuba. “I’m so sorry for your loss.”</p>\n<p>She took a long drag from her cigarette. The lines on her face deepened. “Thank you. My poor baby Inna...” She covered her face as it convulsed slightly.</p>\n<p>Star let the silence hang in the air. They knew her pain.</p>\n<p>Her hand left her face and she was back to not showing them anything. “I miss her so much...”</p>\n<p>Star nodded. “Before we start, I do need to know what you intend to do during the channeling. You will be speaking to Inna, but she’ll be in my body.”</p>\n<p>Lyuba nodded slowly. “I just need to tell her I love her. Give her little scritches. Know that she still loves me.”</p>\n<p>Star closed their eyes and concentrated on their breathing. Energy flowed along their skin like mud being pulled across the ground. It accumulated around their middle finger as a pressure on the outer joint, a slight tug on it from the small grave. They got up. The tug didn’t impede their movement, but it told them where the grave was. “We should probably go inside for this.”</p>\n<p>Lyuba rented the back room of the house. The floor was strewn with clothes. Clothes that stunk. She didn’t have much in terms of furniture, only a bed and a dresser. But she had a cat tower and a lot of cat toys. She had clearly spent more money buying things for Inna than herself.</p>\n<p>Star cleared a spot of dirty clothes and sat down crosslegged. “In just a moment I’m going to be channeling Inna into my body. This will still be my body and I can take control back at any time. But the spirit of your dead cat will be inside of me. She will remember everything from when she was alive and she’ll act like she did in life. Are you ready for that?”</p>\n<p>Lyuba simply nodded. With her affirmative, Star closed their eyes and began to control their breathing.</p>\n<p>Quietly, they chanted, “Inna! Inna! Inna!” The pressure around their middle finger thrummed. They pulled against it. The pressure let up as if something had come lose.</p>\n<p>They were Inna.</p>\n<p>Their eyes opened and they looked around. They leaned forward and clawed at the ground, but their claws didn’t catch on it like they used to.</p>\n<p>“Inna?” The voice was soft. They were used to it booming. They looked up. They were filled with love.</p>\n<p>The soft voice spoke, again. “Lyublyu tebe.” Her arms wrapped around them. They felt their love returned.</p>\n<p>Softly they murred, rubbing their face against their mom. She gave them scritches on their head.</p>\n<p>“I’m so sorry. If there was anything I could have done to help you...” They didn’t know how they understood her, but they did. There was nothing that could’ve been done. In the end, they hadn’t wanted to keep going. Life had become too much and they didn’t want to continue.</p>\n<p>Their face was wet and they didn’t understand why. They stayed there for awhile, their mother’s arms around them and water flowing down their cheeks.</p>\n<p>Finally, their mother let go of them. Her voice came out strange. It was weak and cracked. “I would like to end this session.”</p>\n<p>They were Star again.</p>\n<p>Silence hung for several moments before they spoke. “She really loved you. I could feel what she felt, and there was an overwhelming feeling of love. You were her mother.”</p>\n<p>Tears ran down Lyuba’s face. Her voice came out cracked when she finally spoke. “Did she blame me? For her death?”</p>\n<p>Star shook their head. “It was her time to go. She’d lived a good life, but she couldn’t handle living too much longer.”</p>\n<p>Lyuba nodded slowly. “Thank you.”</p>",
            "author": {
                "name": "Zara RW Storm"
            },
            "tags": [
            ],
            "date_published": "2020-08-09T21:01:55-06:00",
            "date_modified": "2020-08-09T21:01:55-06:00"
        },
        {
            "id": "https://deathpigeon.github.io/zara-rw-storm/ghost-crimes/",
            "url": "https://deathpigeon.github.io/zara-rw-storm/ghost-crimes/",
            "title": "Ghost Crimes",
            "summary": "The past haunts the present. Ghosts and spirits inhabit every corner of our world. For some, this is a thing of wonder and beauty. For others, this is another avenue for violence. Star is a psychic medium who helps people talk to various ghosts and&hellip;",
            "content_html": "<p class=\"align-center\">The past haunts the present. Ghosts and spirits inhabit every corner of our world. For some, this is a thing of wonder and beauty. For others, this is another avenue for violence. Star is a psychic medium who helps people talk to various ghosts and spirits to resolve conflicts between them. But, when crimes are done to ghosts, the present does violence to the past, it's on them to solve it.</p>\n<p class=\"align-center\">Murder? Theft? Eviction? Assault? Against ghosts??</p>\n<h2 class=\"align-center\">GHOST CRIMES!</h2>\n<p> </p>\n<h4>Cases:</h4>\n<p>Case 1: DOUBLE MURDER (Out September 1st)</p>\n<h4>Side Stories:</h4>\n<p><a href=\"https://deathpigeon.github.io/zara-rw-storm/farewell-ghost-crimes/\">Farewell.</a></p>",
            "author": {
                "name": "Zara RW Storm"
            },
            "tags": [
            ],
            "date_published": "2020-08-09T21:01:55-06:00",
            "date_modified": "2020-08-09T21:01:55-06:00"
        }
    ]
}
